[
  {
    "palavra_chave": "save",
    "definicao_pt": "O verbo 'save' significa conservar algo para usar mais tarde ou evitar desperdício. Em português, ele funciona como verbo transitivo direto: ‘Ele salvou o arquivo’ ou como verbo intransitivo: ‘O dinheiro foi salvo na conta’. Dica prática: quando o objeto direto é um arquivo, use o imperativo ‘Salve seu trabalho antes de fechar o programa’ para garantir que nada seja perdido.",
    "exemplos": [
      {
        "level": "A2",
        "size": "medium",
        "phrase": "I save a 60 seconds clip of a few more acting actions that show advanced adjectives and the alphabet, although anything might seem boring, but it belongs to the basics of beach beauty, and I become cheerful when I choose to share it, because the coffee shop next to the cold stare that comes in with a clickbait message commands me to keep the video safe, and I realize cooking and counting countries currently is my new hobby, and I am clumsy with clothes but I still try to keep everything organized."
      },
      {
        "level": "B1",
        "size": "medium",
        "phrase": "I save my notes for later because the business meeting at the inner city office is going to include a presentation on food words and cooking techniques, and I want to keep it safe for her and for him, because the investors might ask about the nutrition, health, and meaning of the recipes, and I also want to share the data with my classmates, so I choose to write them down, hand them out, and also keep them on my tablet, which will allow me to read them whenever I need, and I will also bring the handouts to the cafeteria, where everyone can use them, and the teacher will be proud, while the closing remarks are about the future, and I bring my clothes, a few more notebooks, and a cold stare that comes in to remind me that I have to be firm, as as I think so, I will be clumsy but I am going to save the data because I know that it's worth it."
      },
      {
        "level": "B2",
        "size": "medium",
        "phrase": "I save the audio file for later because the advanced course on math and reading requires me to have the data ready, and the instructor said that the meaning of the content is essential for my fluency, so I keep the file on my hard drive, and I also back it up to the cloud, and I use the USB to share it with the group, where my classmates are going to review it, and the teacher will show me the way to use the word as a shiny word, and I will also use it in role play, so I need to know that my homework is not too bright, and I also need to treat it carefully, because the file contains a few more details about the topic, and I also want to make sure that it is not lost, so I will keep it in a safe place, and I will bring it to the meeting where we will discuss the future of the project, and I will show them the data, and I will ask them to think about it thoroughly, because the file includes a few more adjectives that describe the alphabet, the food, the health, the beauty, and the technology, and I think that having this data is a temporary necessity, and I will bring it with me in case I need to reference it over there, and I will also let them know that it's worth the time to learn about the topic, and I will keep my clothes and a few more items close by, so I can quickly access it if I need to."
      }
    ]
  },
  {
    "palavra_chave": "save",
    "definicao_pt": "Salvar significa guardar algo para usar depois, economizar recursos ou proteger alguém de perigo. Em português, dizemos 'salvar' quando mantemos um arquivo, economizamos tempo ou ajudamos alguém a escapar de um problema. Dica: use \"save\" antes de um arquivo ou ação para indicar que está guardando algo.",
    "exemplos": [
      {
        "level": "A2",
        "size": "medium",
        "phrase": "After the classroom, I decided to save a few more minutes by catching the train, because the store was close to the beach, I could grab coffee, and I thought saving time would help me choose the best food, clothes, and home items, which are essential for health, for beauty, for work, for her, for him, and for women, while the instructor reminded us that saving effort is part of the basics of fluency, and it also teaches us that every action, even a simple one, can save resources and improve our day, for example, I might spend 60 seconds, a few more, acting, actions, adjectives, advanced, alphabet, although, anything, anywhere, apostrophe, basics, beach, beauty, become, belong to, boring, borrow, business, chatted, cheerful, chilling, choose, classroom, clickbait, closing, clothes, clumsy, coffee, cold stare, comes in, commands, cooking, counting, countries, currently, downstairs, each other, education, enough, everywhere, firm, fluency, food, food words, foot, for beauty, for food, for health, for her, for him, for when, for women, for work, gathers, go to the, going to, hand, handouts, head, headache, headaches, health, hideous, high, home items, i think so, in a while, influencer, inner city, instead, investors, is thirsty, it is, it led, itch, its worth, knew, learning, math, meaning, might, mouth, my purpose, necessity, nowhere, often, over there, ownership, people, plate, reaches, reading, reason, relatives, right, role play, seat, security, she stands, shiny word, ship word, shorter, shortest, should, shout, show me, slightly, somewhere, spanish, steadfast, sunshine, surgery, tall short, teacher, tema often, tema there, tema those, tema whose, temporary, that, that itch, that was, that word, thats fine, the store, the wind, them, there, there are, there is, there isnt, they are, they arent, thing, think, think in, think verb, this that, thoroughly, those, to belong, to bloom, to borrow, to have, to know, too boring, too bright, tough, treat word, try it on, warehouse, warmth, weather, wheat, whenever, whereas, which, whistle, whose, wipes off, wrapper, writing."
      },
      {
        "level": "B1",
        "size": "medium",
        "phrase": "During the workshop, I tried to save the presentation file by using the keyboard shortcut, which was a quick way to save my work and avoid losing data, and the instructor reminded us that saving files regularly helps us stay organized, reduces stress, and ensures that our creative projects are protected, especially when working on complex assignments that require advanced editing skills, and that each other can learn from each other's mistakes to make the final product even better."
      },
      {
        "level": "B2",
        "size": "medium",
        "phrase": "When the meeting ended, I used the 'save' button to preserve all the notes I had taken, ensuring that nothing important would be lost, and then I emailed the document to my teammates so we could all save time and stay on track for the upcoming project deadline, which required us to collaborate across countries, coordinate actions, and follow a clear timeline, while the team leader stressed the importance of security and that each other should check the final version for errors to avoid headaches."
      }
    ]
  },
  {
    "palavra_chave": "save",
    "definicao_pt": "Salvar significa guardar algo para usar depois, economizar dinheiro ou proteger algo de dano. É o ato de manter algo seguro ou evitar desperdício.",
    "exemplos": [
      {
        "level": "A2",
        "size": "short",
        "phrase": "Save coffee and food for health."
      },
      {
        "level": "B1",
        "size": "medium",
        "phrase": "She says 'save' to remind herself to save coffee, clothes, and food for alphabet basics."
      },
      {
        "level": "B2",
        "size": "long",
        "phrase": "While teaching basic cooking, we encourage students to save food, save money, practice reading, writing, math, and clothes, learn advanced skills, learning, strengthen health, beauty, education, and environment."
      }
    ]
  }
]