{
  "stories": [
    {
      "title": "Shopping Looking Phrase",
      "text": "When you enter a shop, you might say, \"I'm just looking.\" This means you are browsing, not buying. The shopkeeper may ask if you need help, and you can reply politely. Quando você entra em uma loja, pode dizer: \"Eu só estou olhando.\" Isso significa que você está navegando, não comprando. O atendente pode perguntar se você precisa de ajuda, e você pode responder educadamente."
    },
    {
      "title": "Looking For Expressions",
      "text": "When I was in the city, I was looking for a quiet café. I asked the locals, and they directed me to a small place on the corner. I found it and enjoyed a cup of coffee. Quando estava na cidade, eu estava procurando um café tranquilo. Perguntei aos locais, e eles me indicaram um pequeno lugar na esquina. Eu o encontrei e aproveitei uma xícara de café."
    },
    {
      "title": "Rain Weather Contrast",
      "text": "The city has been experiencing heavy rain for the past week. Despite the continuous downpour, the temperature remains high, making the streets humid and uncomfortable. Residents are hoping that the weather will improve soon. A cidade tem enfrentado chuva forte na última semana. Apesar da chuva contínua, a temperatura permanece alta, tornando as ruas úmidas e desconfortáveis. Os moradores esperam que o tempo melhore em breve."
    },
    {
      "title": "Despite Contrast Preposition",
      "text": "Despite the heavy traffic, Maria arrived at the meeting on time. She had planned her route carefully and left early. Despite being nervous, she spoke confidently and impressed everyone. Apesar do tráfego intenso, Maria chegou ao encontro a tempo. Ela havia planejado sua rota cuidadosamente e saiu cedo. Apesar de estar nervosa, ela falou com confiança e impressionou a todos."
    },
    {
      "title": "Despite Out Of Money",
      "text": "Despite being out of money, Maria decided to travel to Lisbon at the end of the year. She saved every penny she could and found cheap flights. Meanwhile, her friend João bought a call option on a tech stock, but it remained out of the money because the price dropped. Apesar de não ter dinheiro, Maria decidiu viajar para Lisboa no final do ano. Ela economizou cada centavo que pôde e encontrou voos baratos. Enquanto isso, seu amigo João comprou uma opção de compra em uma ação de tecnologia, mas ela permaneceu fora do dinheiro porque o preço caiu."
    },
    {
      "title": "No Money Despite Although",
      "text": "Maria had no money, but she still wanted to buy a new book. Despite having no money, she decided to borrow it from a friend. Although it was expensive, she thought it was worth the effort. Maria não tinha dinheiro, mas ainda queria comprar um livro novo. Apesar de não ter dinheiro, ela decidiu pegar emprestado de um amigo. Embora fosse caro, ela achou que valia a pena o esforço."
    },
    {
      "title": "Death Die Passed Away",
      "text": "When we talk about death, we often use words that are gentle and respectful. In English, we say \"die\" for a general statement, and we use the phrase \"passed away\" when we want to be more polite. For example, a doctor might say, \"The patient passed away last night,\" while a friend might simply say, \"He died at 70.\" Understanding these differences helps us communicate with sensitivity. Quando falamos sobre a morte, costumamos usar palavras que são gentis e respeitosas. Em inglês, dizemos \"die\" para uma declaração geral, e usamos a expressão \"passed away\" quando queremos ser mais polidos. Por exemplo, um médico pode dizer, \"The patient passed away last night,\" enquanto um amigo pode simplesmente dizer, \"He died at 70.\" Entender essas diferenças ajuda a comunicar com sensibilidade."
    },
    {
      "title": "Worth Expressions",
      "text": "When deciding whether to take on a new project, consider if it's worth the effort. Even if the task seems difficult, the potential benefits can outweigh the challenges. Ao decidir se deve assumir um novo projeto, considere se vale a pena o esforço. Mesmo que a tarefa pareça difícil, os benefícios potenciais podem superar os desafios."
    },
    {
      "title": "Shopping Eco Friendly",
      "text": "My wife likes to buy clothes at the local mall. She prefers eco-friendly fabrics because she cares about the environment. Every month she finds new styles that are both fashionable and sustainable. Minha esposa gosta de comprar roupas no shopping local. Ela prefere tecidos ecológicos porque se importa com o meio ambiente. Todo mês ela encontra novos estilos que são ao mesmo tempo modernos e sustentáveis."
    },
    {
      "title": "Dev Workflow Terms",
      "text": "Last Friday, I worked on mapping Zoho and TR statuses. Vinicus pushed the PR to the development environment, and after pushing, I performed tests. Everything works well. Now, I'm refining the code, and the next step is to add variant statuses. Na última sexta-feira, eu trabalhei em mapear os status do Zoho e do TR. Vinicus enviou o PR para o ambiente de desenvolvimento, e depois de enviar, realizei testes. Tudo funciona bem. Agora, estou aperfeiçoando o código, e o próximo passo é adicionar estados variantes."
    },
    {
      "title": "Comparisons Faraway Sample",
      "text": "I have created my own study process and I am studying with him for 30 minutes a day. We use a sample handout in PDF to practice. Many studies show that almost everyone improves wellIbeing when they compare their progress. Everything else is optional, but far away goals are still within reach. Eu criei meu próprio processo de estudo e estou estudando com ele por 30 minutos por dia. Usamos um exemplo de handout em PDF para praticar. Muitos estudos mostram que quase todos melhoram o bemIestar quando comparam seu progresso. Tudo o que sobra é opcional, mas metas distantes ainda estão ao alcance."
    },
    {
      "title": "Cheapest Maybe Intent",
      "text": "I intend to study with him partially, but I will also attend the class alone. Maybe we can meet after class to review the material. The cheapest option for a study group is to use the library, which is free. Eu pretendo estudar com ele parcialmente, mas também irei assistir à aula sozinho. Talvez possamos nos encontrar depois da aula para revisar o material. A opção mais barata para um grupo de estudo é usar a biblioteca, que é gratuita."
    },
    {
      "title": "Contract Intention",
      "text": "My contract with Aliança was for 3 months, but I intend to renew. My contract with KNN is for 2 years and I will continue this study. I want to have extra classes with a teacher outside of Aliança. For a while I only think about it, and I keep thinking about how to improve my skills. Meu contrato com a Aliança durava três meses, mas eu pretendo renováIlo. Meu contrato com a KNN tem 2 anos e eu continuarei este estudo. Eu quero ter aulas extras com um professor fora da Aliança. Durante um tempo eu só penso nisso, e continuo pensando em como melhorar minhas habilidades."
    },
    {
      "title": "Weekend Travel Conferences",
      "text": "Last weekend I went to Águas de Lidoia with my wife. We also attended a couple of conferences. It was raining a lot there, but the event was very good despite the rain. I spent precious time with my wife and we had a wonderful picnic. No fim de semana passado eu fui à Águas de Lidoia com minha esposa. Também participamos de algumas conferências. Estava chovendo muito lá, mas o evento foi muito bom apesar da chuva. Passei um tempo precioso com minha esposa e tivemos um piquenique maravilhoso."
    },
    {
      "title": "Expressions And Phrases",
      "text": "When I first visited the city, I thought I would never again feel so lost. The streets were confusing, and I couldn’t find my way. I told my friend, \"It isn’t for you; I can’t tell you that you’re using the word ‘intent’ and pretending correctly now.\" He laughed and said, \"No more worries, we’ll get there together.\" Quando visitei a cidade pela primeira vez, achei que nunca mais me sentiria tão perdido. As ruas eram confusas e eu não conseguia encontrar meu caminho. Eu disse ao meu amigo: \"Não é para você; não posso dizer que você está usando a palavra ‘intent’ e fingindo corretamente agora.\" Ele riu e disse: \"Não mais preocupações, chegaremos lá juntos.\""
    },
    {
      "title": "Might Maybe Later Concern",
      "text": "During the meeting, the manager said, \"The last one might be a later concern,\" and everyone nodded. Later, a colleague added, \"Maybe we should focus on the main task first.\" The team decided to postpone the discussion about the last item until next week. Durante a reunião, o gerente disse: \"O último pode ser uma preocupação posterior\", e todos acenaram. Mais tarde, um colega acrescentou: \"Talvez devêssemos focar na tarefa principal primeiro.\" A equipe decidiu adiar a discussão sobre o último item até a próxima semana."
    },
    {
      "title": "Time Expressions For When Soon",
      "text": "I have a meeting tomorrow. I will call you soon. Use this for when you’re tired. It was too soon to leave the office early. Eu tenho uma reunião amanhã. Eu te ligarei em breve. Use isso para quando você estiver cansado. Foi cedo demais para sair do escritório cedo."
    },
    {
      "title": "Verb Tenses And Expressions",
      "text": "She stands at the podium and says, ‘Good luck to everyone.’ I knew the answer to the question, but I was bitten by a stray dog earlier. They are tired after the long walk, so they decided to take a short nap. I enjoy writing stories and sometimes whistle quietly while I write. Ela está no palco e diz: ‘Boa sorte a todos.’ Eu sabia a resposta à pergunta, mas fui mordido por um cachorro de rua mais cedo. Eles estão cansados depois da longa caminhada, então decidiram tirar uma soneca curta. Eu gosto de escrever histórias e às vezes apito silenciosamente enquanto escrevo."
    },
    {
      "title": "Affordable Expensive Vocab",
      "text": "Many people look for affordable options when traveling. However, some destinations offer expensive experiences that are worth the cost. Choosing between unaffordable and expensive can be challenging, especially when budgets are tight. Muitas pessoas procuram opções acessíveis quando viajam. No entanto, alguns destinos oferecem experiências caras que valem o custo. Escolher entre inadquível e caro pode ser desafiador, especialmente quando o orçamento é apertado."
    },
    {
      "title": "Fashion Confidence Vocab",
      "text": "Maria loves fashion. Every morning she chooses an outfit that makes her look stylish. She proudly shows her new clothes to her friends. However, she knows that wearing too many accessories can be compromising if she forgets to check her safety. She always balances style with safety. Maria ama moda. Todas as manhãs, ela escolhe um conjunto que a faz parecer elegante. Ela exibe orgulhosamente suas roupas novas para os amigos. No entanto, ela sabe que usar muitos acessórios pode ser comprometedor se ela esquecer de verificar sua segurança. Ela sempre equilibra estilo com segurança."
    },
    {
      "title": "Business Work Vocabulary",
      "text": "During the product launch, the team’s responsiveness impressed everyone. They worked properly and were ready for demo. The next step was to finalize handling of non-user-facing statuses. After the rollout, we confirmed stability after recent deployment. It was almost finished, but we realized it was too soon to announce the release. Durante o lançamento do produto, a rapidez da equipe impressionou a todos. Eles funcionaram corretamente e estavam prontos para demonstração. O próximo passo foi concluir o tratamento de status que não são mostrados ao usuário. Após o lançamento, confirmamos a estabilidade após a implantação recente. Estava quase concluído, mas percebemos que era cedo demais para anunciar o lançamento."
    },
    {
      "title": "Greatly Enhance Vocab",
      "text": "In today's fast-paced world, tools that greatly enhance learning are in high demand. Companies invest in software that can greatly enhance employee productivity, leading to better results and happier teams. No mundo acelerado de hoje, ferramentas que aumentam muito o aprendizado são muito procuradas. As empresas investem em softwares que podem melhorar muito a produtividade dos funcionários, resultando em melhores resultados e equipes mais felizes."
    },
    {
      "title": "Expressions Intensity And Praise",
      "text": "When I saw the new puppy, I said, \"That's cute!\" The owner smiled and said, \"Yes, it's very cute. I think that's smart to keep it indoors during the night.\" I nodded, feeling that much more confident about pet care. Quando vi o novo filhote, eu disse: \"Isso é fofo!\" O dono sorriu e disse: \"Sim, é muito fofo. Acho que é inteligente mantê-lo dentro de casa durante a noite.\" Eu acenei, sentindo-me muito mais confiante sobre cuidados com animais."
    },
    {
      "title": "Earns Businesswork General",
      "text": "Many people work hard to earn a living. Some earn a living by selling products, while others earn a living by providing services. The amount you earn depends on your skills, experience, and the effort you put in. Muitas pessoas trabalham duro para ganhar a vida. Algumas ganham a vida vendendo produtos, enquanto outras ganham a vida oferecendo serviços. O valor que você ganha depende de suas habilidades, experiência e do esforço que você dedica."
    },
    {
      "title": "Phrasal Verbs Live Look",
      "text": "I live on sponsorship, so I can focus on my art. Parently, the gallery is open, and apparently everyone loves the new exhibition. I am looking at the painting on the wall, and it inspires me. Eu vivo de patrocínio, então posso me concentrar na minha arte. Aparentemente, a galeria está aberta, e aparentemente todos adoram a nova exposição. Estou olhando a pintura na parede, e ela me inspira."
    },
    {
      "title": "Business Work General Vocab",
      "text": "During the meeting, I gave a brief introduction explaining what is expected in the flow. I split my screen to make it easier to view changes on both platforms. On one side we have a Zoho display, and on the other side we have the Theft Portal. I will create a new thread on the theft portal to report it. It should be displayed on Zoho, and after that, I will change the statuses in Zoho. Some things still need to be adjusted, but it is working as expected. Durante a reunião, eu fiz uma breve introdução explicando o que se espera no fluxo. Eu dividi a tela para facilitar a visualização das alterações em ambas as plataformas. Do um lado temos uma tela do Zoho, do outro lado temos o Portal de Roubo. Eu criarei um novo tópico no portal de furtos para relatar. Deve ser exibido no Zoho, e depois disso, eu alterarei os status no Zoho. Algumas coisas ainda precisam ser ajustadas, mas está funcionando conforme esperado."
    },
    {
      "title": "Awesome Expressions",
      "text": "At the new art gallery, the exhibition was truly awesome. Visitors said, \"It looks awesome,\" and many were glad they liked it. The curator, excited, said, \"I'm really happy to hear that you enjoyed the show. The pieces are really nice and so cool that it works, especially the interactive installation.\" Everyone left with smiles. Na nova galeria de arte, a exposição foi realmente incrível. Os visitantes disseram: \"Parece incrível\", e muitos ficaram felizes por terem gostado. O curador, animado, disse: \"Estou realmente feliz em saber que você gostou da mostra. As peças são muito boas e tão legais que funcionam, especialmente a instalação interativa.\" Todos saíram com sorrisos."
    },
    {
      "title": "Pity Math Sick Instead",
      "text": "Yesterday, I was sick one day and slept. When I woke up, I saw my sticker collection on the fridge. I admired how she makes math look easy, but I still felt pity for the stray dog outside. Instead of going out, I stayed home and read about shiny coins and fruit-shaped toys. He has over 500 books in his library, and he likes the way the city lights twinkle at night. They almost look real, but I doubt their authenticity. Ontem, eu fiquei doente um dia e dormi. Quando acordei, vi minha coleção de adesivos na geladeira. Admiro como ela faz a matemática parecer fácil, mas ainda senti pena do cachorro de rua lá fora. Em vez de sair, fiquei em casa e li sobre moedas brilhantes e brinquedos em formato de fruta. Ele tem mais de 500 livros na biblioteca, e ele gosta da maneira como as luzes da cidade piscam à noite. Eles quase parecem reais, mas duvido de sua autenticidade."
    },
    {
      "title": "Do Not Feel Sorry Prefer Asking",
      "text": "When you face a difficult situation, remember: Do not feel sorry for the mistake. Instead, learn from it. I prefer that you keep asking them for guidance, because their experience will help you grow. Quando você enfrentar uma situação difícil, lembre-se: Não se arrependa pelo erro. Em vez disso, aprenda com ele. Prefiro que você continue perguntando a eles por orientação, porque a experiência deles vai te ajudar a crescer."
    },
    {
      "title": "Quantifiers And May Confuse",
      "text": "When learning English, students often encounter words that can be confusing. For example, the word 'bank' can refer to a financial institution or the side of a river. Using quantifiers correctly helps avoid misunderstandings. 'Some' is used for an indefinite amount, 'few' indicates a small number, and 'a couple' means exactly two. Ao aprender inglês, os estudantes frequentemente encontram palavras que podem ser confusas. Por exemplo, a palavra 'bank' pode se referir a uma instituição financeira ou à margem de um rio. Usar quantificadores corretamente ajuda a evitar mal-entendidos. 'Some' é usado para uma quantidade indefinida, 'few' indica um pequeno número, e 'a couple' significa exatamente dois."
    },
    {
      "title": "Business Work General Vocab",
      "text": "During the audit, I noted some necessary changes and also some errors in the mapping. The team discussed these points and planned corrective actions. Durante a auditoria, eu notei algumas mudanças necessárias e também alguns erros no mapeamento. A equipe discutiu esses pontos e planejou ações corretivas."
    },
    {
      "title": "Modal Verbs Concerns",
      "text": "When learning English, it is helpful to practice modal verbs. For example, you can say 'Maybe we can go to the park' or 'Can we do it together'. These phrases show how to ask for permission or suggest an action. Remember that modal verbs do not change with the subject, so 'I can', 'you can', 'they can' all use the same form. Ao aprender inglês, é útil praticar verbos modais. Por exemplo, você pode dizer 'Talvez possamos ir ao parque' ou 'Podemos fazer isso juntos'. Essas frases mostram como pedir permissão ou sugerir uma ação. Lembre-se de que os verbos modais não mudam com o sujeito, então 'eu posso', 'você pode', 'eles podem' usam a mesma forma."
    },
    {
      "title": "Reschedule Meeting",
      "text": "During the conference, the organizer announced that the keynote speaker would be delayed. \"We will need to reschedule the session,\" she said. Everyone understood that the new time would be announced later. Durante a conferência, o organizador anunciou que o palestrante principal seria atrasado. \"Precisaremos reagendar a sessão,\" ela disse. Todos entenderam que o novo horário seria anunciado mais tarde."
    },
    {
      "title": "Even Despite Expressions",
      "text": "Even with a small budget, the team managed to finish the project on time. Despite the rain, we went out for a walk. Even with the rain, the picnic went ahead as planned. Mesmo com um orçamento pequeno, a equipe conseguiu terminar o projeto a tempo. Apesar da chuva, nós saímos para uma caminhada. Mesmo com a chuva, o piquenique continuou como planejado."
    },
    {
      "title": "Dismisses Concerns Business",
      "text": "During the meeting, the manager dismissed the concerns of the team. He said the issues were minor and would be addressed later, maybe for later consideration. Durante a reunião, o gerente descartou as preocupações da equipe. Ele disse que os problemas eram menores e seriam resolvidos depois, talvez para consideração futura."
    },
    {
      "title": "Rock And Standup Terms",
      "text": "During the standup time, the team discussed how they were already rocking their new project. Even with a bad day, they stayed motivated, believing that their hard work would pay off. The manager praised them, saying they truly inspired everyone. Durante o horário da reunião diária, a equipe discutiu como já estava arrasando com seu novo projeto. Mesmo com um dia ruim, eles permaneceram motivados, acreditando que seu trabalho duro daria resultado. O gerente os elogiu, dizendo que eles realmente inspiraram todos."
    },
    {
      "title": "Grammar Wonder Whether Vs If",
      "text": "When you are curious, you can say 'I wonder...'. For example, 'I wonder if the train is on time.' The word 'whether' is used to show a choice, like 'whether to stay or leave.' In contrast, 'if' is used for conditions, e.g., 'If it rains, we stay inside.' Quando você está curioso, pode dizer 'I wonder...'. Por exemplo, 'I wonder if the train is on time.' A palavra 'whether' é usada para mostrar uma escolha, como 'whether to stay or leave'. Em contraste, 'if' é usado para condições, por exemplo, 'If it rains, we stay inside.'"
    },
    {
      "title": "Future Tense Going To",
      "text": "You are going to update the software tomorrow. When you update, the system will restart automatically. Remember to ask, \"When are you going to update the documentation?\" before the meeting. Você vai atualizar o software amanhã. Quando você atualizar, o sistema reiniciará automaticamente. Lembre-se de perguntar: \"Quando você vai atualizar a documentação?\" antes da reunião."
    },
    {
      "title": "Past Tenses And Questions",
      "text": "Yesterday, I was going to do my homework, but I decided to play outside instead. I didn't see the related steps there, so I had to ask for help. Later, I learned that the FAQs will cover all steps, which made me feel more confident. Ontem, eu ia fazer minha lição de casa, mas decidi brincar lá fora em vez disso. Eu não vi os passos relacionados lá, então tive que pedir ajuda. Depois, descobri que as FAQ cobrirão todos os passos, o que me deixou mais confiante."
    },
    {
      "title": "Expressions And Concerns",
      "text": "I was thinking about whether it is worth trying to learn a new language. Even if it seems difficult at first, I know that soon I will feel more confident. I worry about the time I will spend, but my concern for personal growth keeps me motivated. Later concern will be about how to use the language in real life. Eu estava pensando se vale a pena tentar aprender um novo idioma. Mesmo que pareça difícil no começo, sei que em breve me sentirei mais confiante. Eu me preocupo com o tempo que vou gastar, mas minha preocupação com o crescimento pessoal me mantém motivado. A preocupação futura será sobre como usar o idioma na vida real."
    },
    {
      "title": "Worth It Expensive Wonder",
      "text": "When deciding to buy a new phone, many people ask themselves, \"Is it worth it even if it's expensive?\" Some also wonder whether the latest features will improve their daily life. These questions help them weigh cost against benefit. Ao decidir comprar um novo telefone, muitas pessoas se perguntam: \"Vale a pena mesmo se for caro?\" Algumas também se perguntam se os novos recursos melhorarão sua vida diária. Essas perguntas ajudam a pesar o custo contra o benefício."
    },
    {
      "title": "Smart Enough And Achieve",
      "text": "Even though it was raining, Maria decided to go to the library. She was smart enough to finish her homework before the deadline. She needed to grasp the concept of fractions, so she practiced with worksheets. Unless the weather improves, she will stay home. She hopes to achieve this goal of mastering math by the end of the semester. Apesar de estar chovendo, Maria decidiu ir à biblioteca. Ela era inteligente o suficiente para terminar a lição de casa antes do prazo. Ela precisava compreender o conceito de frações, então praticou com fichas. A menos que o tempo melhore, ela ficará em casa. Ela espera alcançar esse objetivo de dominar a matemática até o final do semestre."
    },
    {
      "title": "Even Vs Despite",
      "text": "It was raining all day, but the city’s marathon went on. Even with the rain, runners kept their pace. Some even shouted, \"We’re not giving up!\" Despite the heavy downpour, the crowd cheered louder than ever. Choveu o dia todo, mas a maratona da cidade continuou. Mesmo com a chuva, os corredores mantiveram o ritmo. Alguns até gritaram: \"Não vamos desistir!\" Apesar da forte chuva, a multidão aplaudiu mais alto do que nunca."
    },
    {
      "title": "Seen Hadnt Pretty Past",
      "text": "Yesterday, I saw a pretty bird flying near the riverbank. I had never seen such a beautiful sight before. I was pretty excited about the experience and I shared it with my friends. Ontem, eu vi um pássaro bonito voando perto da margem do rio. Eu nunca tinha visto um espetáculo tão bonito antes. Eu estava bem animado com a experiência e a compartilhei com meus amigos."
    },
    {
      "title": "Amazed Me",
      "text": "The night sky lit up with fireworks, each burst brighter than the last. Children ran around, eyes wide, as the colors painted the darkness. The crowd cheered, and the sound of explosions echoed through the streets. It was a moment that amazed everyone, a memory that would last forever. O céu noturno se iluminou com fogos de artifício, cada explosão mais brilhante que a anterior. Crianças correndo, olhos arregalados, enquanto as cores pintavam a escuridão. A multidão aplaudia, e o som das explosões ecoava pelas ruas. Foi um momento que surpreendeu a todos, uma memória que duraria para sempre."
    },
    {
      "title": "Cheerful Adjective Emotions",
      "text": "It was a cheerful morning. The sun shone brightly, and the birds sang a lively tune. People walked down the street with smiles on their faces, ready to start the day. Even the coffee shop owner greeted everyone with a cheerful hello, making the whole town feel warm and happy. Era uma manhã alegre. O sol brilhava intensamente e os pássaros cantavam uma melodia animada. As pessoas caminhavam pela rua com sorrisos no rosto, prontas para começar o dia. Mesmo o dono da cafeteria cumprimentava todos com um 'olá' alegre, fazendo toda a cidade se sentir acolhida e feliz."
    },
    {
      "title": "For A While Vocabulary",
      "text": "I have been here for a while, waiting for the bus. It’s the coldest place I’ve been for a while, and I can’t keep my gloves on. I will wait for a while longer before I decide to go home. Eu tenho estado aqui há algum tempo, esperando o ônibus. É o lugar mais frio que já senti há algum tempo, e não consigo manter meus luvas. Eu vou esperar por mais um tempo antes de decidir ir para casa."
    },
    {
      "title": "Cheering Chilling Breezes",
      "text": "On a sunny afternoon, a cheering breeze swept across the meadow, lifting the spirits of everyone who walked through it. Nearby, a chilling breeze from the lake brought a refreshing coolness that made the day feel like a gentle vacation. Even the thrilling breeze that danced among the trees added a touch of excitement to the peaceful scene. Em uma tarde ensolarada, uma brisa alegre varreu o prado, elevando o espírito de todos que passavam por ali. Perto, uma brisa refrescante do lago trouxe um frescor que fez o dia parecer uma leve férias. Até a brisa emocionante que dançava entre as árvores adicionou um toque de entusiasmo à cena pacífica."
    },
    {
      "title": "In A While",
      "text": "When you are waiting for a friend, you might say, 'I will be ready in a while.' This shows that you expect to finish soon and can start the next activity. Quando você está esperando um amigo, pode dizer: 'Eu estarei pronto em breve.' Isso mostra que você espera terminar em pouco tempo e pode começar a próxima atividade."
    },
    {
      "title": "Not Even In",
      "text": "I have never been to the city, not even in the suburbs. Even in Brazil, the festival is rare. Eu nunca estive na cidade, não sequer nos subúrbios. Mesmo no Brasil, o festival é raro."
    },
    {
      "title": "Have You Ever Expressions",
      "text": "Have you ever wondered why people travel? Many people ask, 'Have you ever been to a foreign country?' They share stories about their adventures. Some say, 'Have you ever tried local food?' These questions help us learn about experiences. Você já se perguntou por que as pessoas viajam? Muitas pessoas perguntam: 'Você já esteve em um país estrangeiro?' Elas compartilham histórias sobre suas aventuras. Algumas dizem: 'Você já experimentou comida local?' Essas perguntas nos ajudam a aprender sobre experiências."
    },
    {
      "title": "Celebrate Holiday Christmas",
      "text": "Every year, families around the world celebrate Christmas. They decorate trees, exchange gifts, and share meals. Celebrating holidays brings joy and togetherness. Todo ano, famílias ao redor do mundo celebram o Natal. Elas decoram árvores, trocam presentes e compartilham refeições. Celebrar feriados traz alegria e união."
    },
    {
      "title": "Expressions Daily Conversation",
      "text": "When you meet someone new, it's common to say 'Hello, how are you?' They might reply 'I'm fine, thank you.' You can respond with 'Great!' Quando você encontra alguém novo, é comum dizer 'Olá, como vai?' Eles podem responder 'Estou bem, obrigado.' Você pode responder com 'Ótimo!'"
    },
    {
      "title": "Out Loud Expressions",
      "text": "Saying words out loud helps you remember them better. When you practice speaking out loud, you notice mistakes and correct them quickly. Try reading a short paragraph aloud every day. Dizer palavras em voz alta ajuda a lembrá-las melhor. Quando você pratica falar em voz alta, percebe erros e os corrige rapidamente. Experimente ler um pequeno parágrafo em voz alta todos os dias."
    },
    {
      "title": "Daily Routine Expressions",
      "text": "Lately, I've been learning about chunks. Whenever I can, I practice them by the end of the day. Most of my days are busy, but I spend most of my time studying. By the end of the day, I review what I've learned. Últimamente, tenho aprendido sobre chunks. Sempre que posso, pratico-os até o fim do dia. A maioria dos meus dias é ocupada, mas gasto a maior parte do meu tempo estudando. Até o fim do dia, reviso o que aprendi."
    },
    {
      "title": "Parking Area One Way Street",
      "text": "When you arrive at the city center, you will notice that most streets are oneIway. This helps traffic flow smoothly. However, you must be careful not to park on a oneIway street, as it is illegal and can result in a fine. Look for a parking area nearby; many malls have large, covered parking areas with electric charging stations. Quando você chegar ao centro da cidade, perceberá que a maioria das ruas são de mão única. Isso ajuda o tráfego a fluir suavemente. No entanto, você deve ter cuidado para não estacionar em uma rua de mão única, pois é ilegal e pode resultar em multa. Procure uma área de estacionamento próxima; muitos shoppings têm grandes áreas de estacionamento cobertas com estações de carregamento elétrico."
    },
    {
      "title": "Not Even Expressions",
      "text": "I didn't have not even a penny when I left the house. She couldn't find not even a single clue in the mysterious note. They left the house without not even checking the front door. Eu não tinha nem mesmo um centavo quando saí da casa. Ela não conseguiu encontrar nem mesmo uma pista única na nota misteriosa. Eles saíram da casa sem nem mesmo verificar a porta da frente."
    },
    {
      "title": "As As Comparisons",
      "text": "In English, we often use 'as ... as' to compare two things. For example, 'The cat is as quiet as a mouse.' This structure helps us express equality without implying superiority or inferiority. Em inglês, usamos frequentemente 'as ... as' para comparar duas coisas. Por exemplo, 'O gato é tão quieto quanto um rato.' Essa estrutura ajuda a expressar igualdade sem implicar superioridade ou inferioridade."
    },
    {
      "title": "Thanks Expressions Grammar",
      "text": "When you want to show appreciation, you can say thanks or thank you. In a workplace, a simple thank you can build good relationships. In everyday life, saying thanks to a friend or a stranger can make the world a little brighter. Quando você quer mostrar apreciação, pode dizer thanks ou thank you. No local de trabalho, um simples thank you pode construir boas relações. Na vida cotidiana, dizer thanks a um amigo ou a um estranho pode tornar o mundo um pouco mais brilhante."
    },
    {
      "title": "Future Simple And Just Today",
      "text": "I will do it today because the deadline is tomorrow. She said she would finish the project just today, and we all agreed to review it by the end of the week. Eu farei isso hoje porque o prazo é amanhã. Ela disse que terminaria o projeto apenas hoje, e todos concordamos em revisá-lo até o fim da semana."
    },
    {
      "title": "So Vs Then Grammar",
      "text": "When planning a trip, you might say, 'I will book the flight, so I can arrive early. Then I will check into the hotel.' This shows how 'so' connects a reason to an outcome, while 'then' shows the next step in time. Ao planejar uma viagem, você pode dizer: 'Eu vou reservar o voo, então posso chegar cedo. Depois, eu vou fazer o check-in no hotel.' Isso mostra como 'so' conecta uma razão a um resultado, enquanto 'then' mostra o próximo passo no tempo."
    },
    {
      "title": "Conditional If When",
      "text": "If it rains tomorrow, we will cancel the picnic. When it is sunny, we like to go to the beach. Use the umbrella when it rains to stay dry. Se chover amanhã, cancelaremos o piquenique. Quando está ensolarado, gostamos de ir à praia. Use o guarda-chuva quando chover para ficar seco."
    },
    {
      "title": "Confirm Understanding Quick Recap",
      "text": "During the weekly project meeting, the team leader asked everyone to confirm their understanding of the new deadlines. After a brief discussion, she gave a quick recap of the action items to ensure everyone was on the same page. Durante a reunião semanal do projeto, o líder da equipe pediu a todos que confirmassem seu entendimento dos novos prazos. Após uma breve discussão, ela deu um resumo rápido dos itens de ação para garantir que todos estivessem na mesma página."
    },
    {
      "title": "Align Terms Business",
      "text": "In business, aligning strategies with company goals is essential. Teams must align their plans with budgets and timelines to succeed. No mundo dos negócios, alinhar estratégias com os objetivos da empresa é essencial. As equipes devem alinhar seus planos com orçamentos e cronogramas para ter sucesso."
    },
    {
      "title": "Issue Alignment Business",
      "text": "In a busy office, the manager noticed an issue with the new software. She decided to align the issue with the IT team’s schedule to avoid delays. By aligning the issue early, the project stayed on track and the budget was not affected. Em um escritório movimentado, o gerente percebeu um problema com o novo software. Ele decidiu alinhar a questão com a agenda da equipe de TI para evitar atrasos. Ao alinhar a questão cedo, o projeto permaneceu no caminho certo e o orçamento não foi afetado."
    },
    {
      "title": "Discuss Talk It",
      "text": "In many meetings, people are asked to discuss the new project plan. Some prefer to talk about it informally before the official presentation. The key is to listen, ask questions, and share ideas. Em muitas reuniões, as pessoas são solicitadas a discutir o novo plano de projeto. Alguns preferem falar sobre isso informalmente antes da apresentação oficial. A chave é ouvir, fazer perguntas e compartilhar ideias."
    },
    {
      "title": "Daily Routine Expressions",
      "text": "Today I have a busy schedule. It's my turn for today to lead the team meeting. After that, it's my goal for today to finish the report. When I need a break, I say Be right back. Hoje tenho uma agenda cheia. É minha vez hoje de liderar a reunião da equipe. Depois disso, meu objetivo para hoje é terminar o relatório. Quando preciso de uma pausa, digo volto em breve."
    },
    {
      "title": "Modal Passive Concerns",
      "text": "During the meeting, the manager said that a new policy may be created if the council gathers enough support. He added that some ideas might be considered later, maybe for later consideration, to keep the discussion open. Durante a reunião, o gerente disse que uma nova política pode ser criada se o conselho reunir apoio suficiente. Ele acrescentou que algumas ideias poderiam ser consideradas mais tarde, talvez para consideração posterior, para manter a discussão aberta."
    },
    {
      "title": "Theatre And Travel Vocab",
      "text": "During the evening performance, the actor forgot his line and had to improvise. After the show, he went to the Lost and Found Center to return a lost ticket. Durante a apresentação da noite, o ator esqueceu sua fala e teve que improvisar. Depois do show, ele foi ao Centro de Itens Perdidos para devolver um ingresso perdido."
    },
    {
      "title": "Scared Emotions",
      "text": "When the lights went out, Maria felt a sudden wave of fear. She was scared of the dark and the noises that echoed through the empty house. She decided to stay in the living room, holding a flashlight, and whispered to herself that she would be okay. Quando as luzes se apagaram, Maria sentiu uma onda súbita de medo. Ela estava assustada com a escuridão e os ruídos que ecoavam pela casa vazia. Ela decidiu ficar na sala de estar, segurando uma lanterna, e sussurrou para si mesma que estaria bem."
    },
    {
      "title": "Expressions Additional Concordance",
      "text": "I like coffee as well. Me too, I enjoy it every morning. Eu gosto de café também. Eu também, gosto dele todas as manhãs."
    },
    {
      "title": "Bootstrap Web Design",
      "text": "Bootstrap is a free, openIsource toolkit that helps developers create responsive websites quickly. It includes preIdesigned components, a grid system, and JavaScript plugins. By using Bootstrap, you can avoid writing complex CSS from scratch and focus on building features. Bootstrap é um kit de ferramentas gratuito e de código aberto que ajuda os desenvolvedores a criar sites responsivos rapidamente. Ele inclui componentes préIdesenhados, um sistema de grade e plugins JavaScript. Ao usar o Bootstrap, você pode evitar escrever CSS complexo do zero e se concentrar em construir funcionalidades."
    },
    {
      "title": "From Scratch Expressions",
      "text": "Starting from scratch can be challenging, but it also gives you full control over the process. Whether you are cooking a meal, building a website, or learning a new skill, doing it from scratch allows you to understand every step. Começar do zero pode ser desafiador, mas também lhe dá controle total sobre o processo. Seja cozinhando uma refeição, construindo um site ou aprendendo uma nova habilidade, fazer isso do zero permite que você compreenda cada etapa."
    },
    {
      "title": "Small Talk General Vocabulary",
      "text": "Small talk is a useful skill in many social situations. Whether you are at a party, in a meeting, or on a flight, a few friendly words can help you feel more comfortable and connect with others. Try to ask simple questions about the weather, hobbies, or recent events. Remember, the goal is to keep the conversation light and positive. Small talk é uma habilidade útil em muitas situações sociais. Seja em uma festa, em uma reunião ou em um voo, algumas palavras amigáveis podem ajudar a se sentir mais confortável e a se conectar com os outros. Tente fazer perguntas simples sobre o tempo, hobbies ou eventos recentes. Lembre-se, o objetivo é manter a conversa leve e positiva."
    },
    {
      "title": "Carefully Roof Damage",
      "text": "When you open the door carefully, you avoid accidents. The roof of the house was damaged by the storm, causing damage to the interior. To prevent further damage, we installed a new roof and placed a carpet near the stairs so that no one would fall. Quando você abre a porta cuidadosamente, evita acidentes. O telhado da casa foi danificado pela tempestade, causando danos ao interior. Para evitar mais danos, instalamos um novo telhado e colocamos um tapete perto das escadas para que ninguém caísse."
    },
    {
      "title": "Summarily Adverb",
      "text": "During the meeting, the manager asked everyone to give a summarily report. Each team member spoke briefly, highlighting only the main points. The manager appreciated the concise style and thanked everyone for their efficient summaries. Durante a reunião, o gerente pediu a todos que fizessem um relatório resumido. Cada membro da equipe falou brevemente, destacando apenas os pontos principais. O gerente apreciou o estilo conciso e agradeceu a todos pela eficiência das resumos."
    },
    {
      "title": "Answer And Talked",
      "text": "When I asked the teacher for help, she gave me a clear answer. He didn't know the answer at first, but after a quick conversation, he understood. I talked to him about it, and we solved the problem together. Later, I talked to him about this one, and he offered to help me with the next project. Quando pedi ajuda ao professor, ele me deu uma resposta clara. Ele não sabia a resposta no início, mas depois de uma conversa rápida, ele entendeu. Eu falei com ele sobre isso, e resolvemos o problema juntos. Mais tarde, falei com ele sobre isso, e ele ofereceu ajudar-me no próximo projeto."
    },
    {
      "title": "Reason Attending Vocab",
      "text": "What is the reason that our company needs to adopt new technology? We have a reason: to stay competitive. I am attending the seminar to learn more about it. Qual é a razão pela qual nossa empresa precisa adotar nova tecnologia? Temos uma razão: permanecer competitiva. Eu estou participando do seminário para aprender mais sobre isso."
    },
    {
      "title": "Anything Abandoned Warehouse",
      "text": "The abandoned warehouse was quiet and dusty. A few workers had come to clean it up. They found old boxes and a broken sign. Even though it was empty, the place felt alive with memories. O armazém abandonado estava quieto e cheio de poeira. Alguns trabalhadores vieram para limpar. Eles encontraram caixas antigas e um letreiro quebrado. Mesmo vazio, o lugar parecia vivo com memórias."
    },
    {
      "title": "Beach Pastor Walkalong",
      "text": "I am at the beach with my pastor. We walk along the shore and talk about faith. The sun shines, and the waves crash softly. It is a peaceful moment. Eu estou na praia com meu pastor. Nós caminhamos ao longo da costa e falamos sobre fé. O sol brilha, e as ondas batem suavemente. É um momento pacífico."
    },
    {
      "title": "Pastor Talking Upcoming",
      "text": "My pastor and I are talking about the upcoming charity event tonight. We are excited because the upcoming concert will be held next Saturday. Meu pastor e eu estamos conversando sobre o evento de caridade que acontecerá esta noite. Estamos empolgados porque o concerto que está por vir será realizado no próximo sábado."
    },
    {
      "title": "Painkillers Surgery Injury",
      "text": "After a minor injury during a soccer match, Maria went to the clinic. The doctor examined her and prescribed painkillers to relieve the pain. She also advised her to rest and avoid strenuous activity. Maria followed the instructions and recovered quickly. Depois de uma lesão menor durante uma partida de futebol, Maria foi à clínica. O médico a examinou e prescreveu analgésicos para aliviar a dor. Ele também a aconselhou a descansar e evitar atividades extenuantes. Maria seguiu as instruções e se recuperou rapidamente."
    },
    {
      "title": "Soon Expressions",
      "text": "Soon is a versatile adverb that can describe events happening in the near future. For example, you might say, 'I will finish my homework soon.' It can also be used in idiomatic expressions like 'too soon,' which warns that something is happening earlier than expected. Understanding these subtle differences helps you sound natural in everyday conversations. Soon é um advérbio versátil que pode descrever eventos que acontecem no futuro próximo. Por exemplo, você pode dizer: 'Eu terminarei a lição de casa em breve.' Ele também pode ser usado em expressões idiomáticas como 'too soon', que alerta que algo está acontecendo mais cedo do que o esperado. Entender essas sutis diferenças ajuda você a soar natural em conversas cotidianas."
    },
    {
      "title": "My Christmas Travel Weather",
      "text": "During the holiday, I shared gifts and memories on My Christmas with family. My Christmas was good, even though there were a few people at home. I went to Campos do Jordão with my family and friends, and we had many memorable moments. It was nice there, even though it hasn't been as cold as expected. After one, we came to our home. My mom came here with my brother and his girlfriend. We went to the beach. Yesterday, it was a sunny day. Those were some good times, indeed. Durante o feriado, eu compartilhei presentes e memórias no meu Natal com a família. Meu Natal foi bom, embora houvesse poucas pessoas em casa. Eu fui a Campos do Jordão com minha família e amigos, e tivemos muitos momentos memoráveis. Foi agradável lá, embora não tenha sido tão frio quanto esperado. Depois de um, chegamos em casa. Minha mãe veio aqui com meu irmão e a namorada dele. Fomos à praia. Ontem, foi um dia ensolarado. Aqueles foram bons tempos, de fato."
    },
    {
      "title": "About My Christmas Travel",
      "text": "I went to Campos do Jordão; it is quite hot, but I would like it to be cold there. After the trip, I told my friends about my Christmas traditions. We managed to finish the preparations on time, and I managed to keep the whole family happy. Fui a Campos do Jordão; está bem quente, mas eu gostaria que ficasse frio lá. Depois da viagem, contei aos meus amigos sobre minhas tradições de Natal. Conseguimos terminar os preparativos a tempo, e eu consegui manter toda a família feliz."
    },
    {
      "title": "Failure And Success Terms",
      "text": "In many businesses, failure is seen as a stepping stone to success. Companies that analyze their failures learn valuable lessons and improve their strategies. By acknowledging mistakes openly, teams can innovate faster and avoid repeating the same errors. Em muitas empresas, a falha é vista como um degrau para o sucesso. As empresas que analisam suas falhas aprendem lições valiosas e aprimoram suas estratégias. Ao reconhecer os erros abertamente, as equipes podem inovar mais rapidamente e evitar repetir os mesmos erros."
    },
    {
      "title": "Statues Games Gems Ring",
      "text": "In the city park, statues of famous heroes stand proudly on the hill. Nearby, children gather to play games, from board games to video games. A small shop sells precious gems, and a bell rings whenever a customer enters. The atmosphere is lively, and everyone feels that the day is so good. No parque da cidade, estátuas de heróis famosos ficam orgulhosamente no alto da colina. Perto, crianças se reúnem para jogar jogos, desde jogos de tabuleiro até videogames. Uma pequena loja vende gemas preciosas, e um sino toca sempre que um cliente entra. A atmosfera é animada, e todos sentem que o dia é tão bom."
    },
    {
      "title": "Sunset Sunrise Sunshine",
      "text": "The morning was bright. The sun rose slowly, painting the sky with pink and orange hues. As the day progressed, the weather stayed sunny, and the gentle breeze carried the scent of blooming flowers. A manhã estava brilhante. O sol nasceu lentamente, pintando o céu com tons de rosa e laranja. À medida que o dia avançava, o clima permanecia ensolarado, e a brisa suave carregava o perfume das flores em flor."
    },
    {
      "title": "The Teeth Chunk Expressions",
      "text": "The teacher gave us a chunk of information. On the whole, the lesson was tough, but we learned a new chunk of language. I brush my teeth after school. O professor nos deu um pedaço de informação. No geral, a aula foi difícil, mas aprendemos um novo pedaço de linguagem. Eu escovo meus dentes depois da escola."
    },
    {
      "title": "General Vocabulary Expressions",
      "text": "I think so, yet I also started reading novels to expand my vocabulary. She has not finished yet, but she will finish soon. That’s fine, we can wait. The headline was misleading, but the deeper meaning was clear. Eu acho que sim, mas também comecei a ler romances para ampliar meu vocabulário. Ela ainda não terminou, mas terminará em breve. Tudo bem, podemos esperar. O manchete foi enganosa, mas o significado mais profundo ficou claro."
    },
    {
      "title": "Prefer Hiking Expressions",
      "text": "When planning a weekend, I prefer hiking to driving because it keeps me active. Some people prefer coffee over tea in the morning. Others say that hiking is better than staying indoors during the rainy season. Ao planejar um fim de semana, eu prefiro fazer trilhas a dirigir porque me mantém ativo. Algumas pessoas preferem café a chá de manhã. Outros dizem que fazer trilhas é melhor do que ficar em casa durante a estação chuvosa."
    },
    {
      "title": "I Worked There Last Year",
      "text": "I worked there last year, and it was a valuable experience. I learned teamwork, improved my communication skills, and gained confidence. Eu trabalhei lá no ano passado, e foi uma experiência valiosa. Aprendi trabalho em equipe, melhorei minhas habilidades de comunicação e ganhei confiança."
    },
    {
      "title": "Hold Safer Security",
      "text": "I keep my phone with me at all times. I hold a small flashlight because I feel safer when walking at night. The security guard checks the cameras to keep the building safe. Eu guardo meu telefone comigo o tempo todo. Eu seguro uma pequena lanterna porque me sinto mais seguro quando caminho à noite. O guarda de segurança verifica as câmeras para manter o prédio seguro."
    },
    {
      "title": "Let You Know Expressions",
      "text": "I will let you know if there are any changes to the schedule. Let me know if you need any help. Thanks for letting me know about the new meeting time. Eu te avisarei se houver alguma mudança no cronograma. Me avise se precisar de ajuda. Obrigado por me avisar sobre o novo horário da reunião."
    },
    {
      "title": "Get Back To You Business",
      "text": "Subject: Follow-up on the project proposal Hi Maria, Thank you for sending the draft of the project proposal. I have reviewed the main points and will get back to you with detailed feedback by Friday. If you have any questions in the meantime, feel free to reach out. Best regards, John Assunto: Retorno sobre a proposta do projeto Oi Maria, Obrigado por enviar o rascunho da proposta do projeto. Eu revisei os pontos principais e retornarei a você com feedback detalhado até sexta-feira. Se você tiver alguma dúvida enquanto isso, sinta-se à vontade para entrar em contato. Atenciosamente, John"
    },
    {
      "title": "Traffic Jam Faster Way",
      "text": "During the busy morning, the traffic jam on the highway caused many drivers to be late. I decided to take a different route, and it was faster this way. Arriving on time, I could attend the meeting without stress. Durante a manhã agitada, o congestionamento na rodovia causou atrasos a muitos motoristas. Decidi pegar uma rota diferente, e foi mais rápido dessa forma. Chegando no horário, pude comparecer à reunião sem estresse."
    },
    {
      "title": "Expressions Agreement",
      "text": "When planning a trip, people often need to confirm details. \"The flight leaves at 8 a.m., I think so, yes,\" said Maria. She was sure the schedule was correct. Later, her friend added, \"We should bring snacks, I think so, yes, it will be helpful.\" They both felt confident about their preparations. Ao planejar uma viagem, as pessoas costumam confirmar detalhes. \"O voo sai às 8h, eu acho que sim,\" disse Maria. Ela estava certa de que o horário estava correto. Mais tarde, sua amiga acrescentou, \"Devemos levar lanches, eu acho que sim, será útil.\" Elas se sentiram confiantes sobre suas preparações."
    },
    {
      "title": "Polite Requests",
      "text": "During the meeting, Maria asked, ‘Would you mind repeating the last point?’ The manager nodded and said, ‘Sure, so I can confirm I understand correctly.’ They both felt more confident about the project. Durante a reunião, Maria perguntou: ‘Você se importaria em repetir o último ponto?’ O gerente assentiu e disse: ‘Claro, para que eu possa confirmar que entendi corretamente.’ Ambos se sentiram mais confiantes sobre o projeto."
    },
    {
      "title": "Expressões Concerto",
      "text": "During the planning meeting, Maria suggested a new schedule. John replied, ‘That sounds good.’ Later, they decided to meet at the café. Maria said, ‘That works for me.’ She added, ‘I will bring a notebook to keep notes.’ Durante a reunião de planejamento, Maria sugeriu um novo cronograma. John respondeu, ‘Isso parece bem.’ Mais tarde, decidiram se encontrar no café. Maria disse, ‘Isso funciona para mim.’ Ela acrescentou, ‘Eu trarei um caderno para fazer anotações.’"
    },
    {
      "title": "Cause Effect And Delay",
      "text": "The train was delayed because of a technical fault. As a result, many passengers missed their connections. The station announced that the delay would last about an hour. O trem estava atrasado por causa de um problema técnico. Como resultado, muitos passageiros perderam suas conexões. A estação anunciou que o atraso duraria cerca de uma hora."
    },
    {
      "title": "Lead Outcome Terms",
      "text": "During the project, several changes were made. The team decided to adopt a new strategy. It led to a different outcome, which surprised everyone. The outcome was better than expected. Durante o projeto, várias mudanças foram feitas. A equipe decidiu adotar uma nova estratégia. Isso levou a um resultado diferente, que surpreendeu a todos. O resultado foi melhor do que o esperado."
    },
    {
      "title": "Work Experience And Regret",
      "text": "During the project review, Maria said, “I’ve already done this before, so I know the steps.” Her colleague replied, “I’ve worked on similar projects, so I can help.” Later, after a mistake, she added, “I wish I had known earlier about the new deadline.” Durante a revisão do projeto, Maria disse: “Eu já fiz isso antes, então conheço os passos.” Seu colega respondeu: “Eu já trabalhei em projetos semelhantes, então posso ajudar.” Mais tarde, após um erro, ela acrescentou: “Eu gostaria que eu soubesse antes sobre o novo prazo.”"
    },
    {
      "title": "Business Work General Vocabulary",
      "text": "During the project meeting, the manager said, “We’re working on the new feature now. The issue was resolved yesterday, so we can move forward. I’d like to focus on the user interface before the launch. I’m looking forward to the client’s feedback.” Durante a reunião do projeto, o gerente disse: “Estamos trabalhando na nova funcionalidade agora. O problema foi resolvido ontem, então podemos avançar. Eu gostaria de me concentrar na interface do usuário antes do lançamento. Estou ansioso(a) pelo feedback do cliente.”"
    },
    {
      "title": "Celebrations Expressions",
      "text": "Maria and João have been planning their wedding anniversary for months. They decided to travel to Paris, where they will celebrate with a candlelit dinner and a stroll along the Seine. They are looking forward to the big day, hoping it will be a memorable experience for both of them. Maria e João têm planejado seu aniversário de casamento há meses. Eles decidiram viajar para Paris, onde vão celebrar com um jantar à luz de velas e uma caminhada ao longo do Sena. Eles estão ansiosos pela grande data, esperando que seja uma experiência memorável para ambos."
    },
    {
      "title": "Idiomatic Phrases General",
      "text": "At the end of the day, we gathered to discuss the project. Last but not least, we thanked everyone for their hard work. She brought her laptop, but I had to take it to the office. The team ended up working late, and we solved problems on our own. No fim das contas, nos reunimos para discutir o projeto. Por fim, mas não menos importante, agradecemos a todos pelo trabalho duro. Ela trouxe seu laptop, mas eu tive que levá-lo para o escritório. A equipe acabou trabalhando até tarde, e resolvemos os problemas por conta própria."
    },
    {
      "title": "Instead General Vocabulary",
      "text": "Instead of spending the weekend at home, Maria decided to visit her grandparents. She packed a bag, took the train, and arrived early. The family welcomed her with a warm hug and a homemade dinner. Maria felt grateful for the unexpected adventure. Em vez de passar o fim de semana em casa, Maria decidiu visitar os avós. Ela arrumou uma mochila, pegou o trem e chegou cedo. A família a recebeu com um abraço caloroso e um jantar caseiro. Maria se sentiu grata pela aventura inesperada."
    },
    {
      "title": "Likewise General Vocabulary",
      "text": "I enjoy hiking in the mountains. Likewise, my friend loves exploring trails and discovering new views. Eu gosto de fazer trilhas nas montanhas. Igualmente, meu amigo adora explorar trilhas e descobrir novas vistas."
    },
    {
      "title": "Tasty Tasteless",
      "text": "When I visited the local market, I tried a new soup. It looked delicious, but the first bite was surprisingly bland. I told the vendor that it was tasty and tasteless, a strange combination that left me puzzled. Quando visitei o mercado local, experimentei uma nova sopa. Parecia deliciosa, mas o primeiro gole foi surpreendentemente sem sabor. Eu disse ao vendedor que era saborosa e sem sabor, uma combinação estranha que me deixou perplexo."
    },
    {
      "title": "Lol And Laugh Out Loud",
      "text": "In modern texting, people often use abbreviations like lol to express laughter quickly. While some may think it is informal, it is widely accepted in casual conversations. When you see someone write \"lol\" after a joke, they are indicating that they found it funny. On the other hand, \"laugh out loud\" is a full phrase that can be used in both spoken and written English to describe a strong laugh. No texto moderno, as pessoas costumam usar abreviações como lol para expressar risadas rapidamente. Embora alguns possam achar que é informal, ele é amplamente aceito em conversas casuais. Quando você vê alguém escrever \"lol\" depois de uma piada, eles indicam que acharam engraçada. Por outro lado, \"laugh out loud\" é uma frase completa que pode ser usada tanto na fala quanto na escrita para descrever uma risada forte."
    },
    {
      "title": "Desire Itch Everything Else",
      "text": "When I think about my future, I feel that itch to explore new cultures. I wish I could travel more, but my schedule is tight. Still, I have a true desire to learn languages, and I plan to start with Spanish next month. Quando penso no meu futuro, sinto aquela coceira de explorar novas culturas. Eu gostaria de viajar mais, mas minha agenda está apertada. Ainda assim, tenho um desejo verdadeiro de aprender idiomas, e planejo começar com espanhol no próximo mês."
    },
    {
      "title": "Keep Principles Respectful",
      "text": "In many cultures, people emphasize the importance of keeping principles. Christian principles, such as love and honesty, guide individuals in both personal and professional settings. Even when the topic is not religious, it is essential to act respectfully and uphold these values. Em muitas culturas, as pessoas enfatizam a importância de manter princípios. Princípios cristãos, como amor e honestidade, orientam os indivíduos tanto em situações pessoais quanto profissionais. Mesmo quando o assunto não é religioso, é essencial agir respeitosamente e manter esses valores."
    },
    {
      "title": "U Haul Behind Hearse",
      "text": "During the move, the family decided to rent a U-Haul truck. They packed their furniture and boxes, then drove to the coast. On the way, they passed a funeral procession. The driver joked that he would never see a U-Haul behind a hearse, but the family laughed and continued their journey. Durante a mudança, a família decidiu alugar um caminhão U-Haul. Eles empacotaram móveis e caixas, depois dirigiram até a costa. No caminho, passaram por uma procissão fúnebre. O motorista brincou que nunca veria um U-Haul atrás de um caixão, mas a família riu e continuou a viagem."
    },
    {
      "title": "Daily Routine Health",
      "text": "Every morning, I get out of bed early, take a shower, and get ready for school. After class, I sometimes step out for a quick walk. If I get a cut while shaving, I use aftershave to soothe the skin. I always keep my grown facial hair trimmed and my hands clean. Todas as manhãs, eu acordo e saio da cama cedo, tomo um banho e me preparo para a escola. Depois da aula, às vezes saio para uma caminhada rápida. Se eu me cortar enquanto me barbeio, uso aftershave para acalmar a pele. Eu sempre mantenho minha barba longa aparada e minhas mãos limpas."
    },
    {
      "title": "Bring Take Get Give Regard However",
      "text": "I bring my notebook to class, take notes, get feedback, and give my homework to the teacher. She regards my effort as impressive. However, she says I need to practice more. Eu trago meu caderno para a aula, faço anotações, obtenho feedback e dou minha lição de casa ao professor. Ela considera meu esforço impressionante. No entanto, ela diz que preciso praticar mais."
    },
    {
      "title": "Candles Home Items",
      "text": "Candles have been used for centuries to provide light and create a warm atmosphere. In many cultures, candles symbolize hope, celebration, and remembrance. When you light a candle, the flame melts the wax, producing a gentle glow that can calm the mind. Velas têm sido usadas há séculos para fornecer luz e criar uma atmosfera acolhedora. Em muitas culturas, velas simbolizam esperança, celebração e lembrança. Quando acende uma vela, a chama derrete a cera, produzindo um brilho suave que pode acalmar a mente."
    },
    {
      "title": "Idioms Expressions English",
      "text": "During the team meeting, the manager decided to break the ice by sharing a funny story. Everyone laughed, and the atmosphere became relaxed. Later, Sarah hit the nail on the head when she pointed out the main issue. The team felt under the weather after a long day, but they managed to finish the project. It was a piece of cake for the new members. Durante a reunião da equipe, o gerente decidiu quebrar o gelo contando uma história engraçada. Todos riram e o clima ficou descontraído. Depois, Sarah acertou no ponto quando apontou o problema principal. A equipe estava indisposta após um dia longo, mas conseguiu terminar o projeto. Foi muito fácil para os novos membros."
    },
    {
      "title": "Forever Although Lastbutnotleast",
      "text": "I promised my friend that I would stay by her side forever. Although the road was long, we kept walking. Last but not least, we celebrated our journey with a small cake. Prometi ao meu amigo que eu ficaria ao seu lado para sempre. Embora o caminho fosse longo, continuamos caminhando. Por último, mas não menos importante, celebramos nossa jornada com um pequeno bolo."
    },
    {
      "title": "Food Cooking Menu Phrases",
      "text": "You walk into a cozy café and ask the waiter, \"May we sit at this table?\" He smiles and says, \"Sure, please have a seat.\" Then you ask, \"Can I see the menu?\" He hands you a paper with dishes. You look at it and ask, \"What's on the menu today?\" Você entra em um café aconchegante e pergunta ao garçom, \"Posso sentar-me nesta mesa?\" Ele sorri e diz, \"Claro, sente-se.\" Depois, você pergunta, \"Posso ver o cardápio?\" Ele entrega um papel com pratos. Você olha e pergunta, \"O que há no cardápio hoje?\""
    },
    {
      "title": "Food Ordering Spicy",
      "text": "At the restaurant, you can say, \"I'll have the steak, please,\" and later ask, \"Is it spicy?\" If you want more, say, \"Could I have another salad, please?\" When finished, ask, \"May I have the check, please?\" No restaurante, você pode dizer: \"Eu gostaria do bife, por favor,\" e depois perguntar: \"Está picante?\" Se quiser mais, diga: \"Poderia me trazer outra salada, por favor?\" Quando terminar, peça: \"Posso receber a conta, por favor?\""
    },
    {
      "title": "Wired Energetic State",
      "text": "When you are wired, you feel a surge of energy that can help you focus. Many people use caffeine to get wired before a big presentation. However, being wired for too long can lead to burnout. Quando você está energizado, sente uma onda de energia que pode ajudar a focar. Muitas pessoas usam cafeína para ficar energizadas antes de uma grande apresentação. No entanto, ficar energizado por muito tempo pode levar ao esgotamento."
    },
    {
      "title": "Yawned Bike Going",
      "text": "On a sunny Saturday, I decided to go to the beach. I packed my bike, a towel, and a sandwich. While riding, I felt the wind and the sand between my toes. After a while, I yawned loudly because the day was long and relaxing. Em um sábado ensolarado, decidi ir à praia. Eu empacotei minha bicicleta, uma toalha e um sanduíche. Enquanto pedalava, senti o vento e a areia entre meus dedos dos pés. Depois de um tempo, bocejou alto porque o dia foi longo e relaxante."
    },
    {
      "title": "General Phrasal Emotions Vocabulary",
      "text": "After the meeting, I will attend to the emails. Afterwards, we will go to the park. Everything else is amazing, especially the new coffee shop. He was in a cheerful mood, which made everyone smile. Depois da reunião, eu vou atender aos e-mails. Depois disso, iremos ao parque. Tudo o que há de mais é incrível, especialmente a nova cafeteria. Ele estava de bom humor, o que fez todos sorrirem."
    },
    {
      "title": "Not To Brag Expressions",
      "text": "Many people use the phrase 'not to brag' when they want to show humility. It signals that they are not trying to impress others. For example, someone might say, 'I finished the marathon, not to brag, but I'm proud of myself.' Muitas pessoas usam a expressão 'not to brag' quando querem demonstrar humildade. Ela indica que não estão tentando impressionar os outros. Por exemplo, alguém pode dizer: 'Eu terminei a maratona, não para ostentar, mas estou orgulhoso de mim mesmo.'"
    },
    {
      "title": "To Brag Phrasal Verbs",
      "text": "Bragging is a common way people share their successes. Some people love to brag about their new gadgets, while others prefer to brag about their cooking skills. However, bragging can sometimes come across as boastful if not done carefully. Se gabar é uma maneira comum de as pessoas compartilharem seus sucessos. Algumas pessoas adoram se gabar de seus novos gadgets, enquanto outras preferem se gabar de suas habilidades culinárias. No entanto, se gabar pode às vezes parecer presunçoso se não for feito com cuidado."
    },
    {
      "title": "Brag Express Pride",
      "text": "Many people love to brag about their successes, but it can sometimes make others feel uncomfortable. It is important to balance confidence with humility, especially in professional settings. Muitas pessoas gostam de se gabar de suas conquistas, mas isso pode deixar os outros desconfortáveis. É importante equilibrar a confiança com a humildade, especialmente em ambientes profissionais."
    }
  ]
}